/*
 Navicat MySQL Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 80017
 Source Host           : localhost:3306
 Source Schema         : grademanage

 Target Server Type    : MySQL
 Target Server Version : 80017
 File Encoding         : 65001

 Date: 06/11/2019 19:29:04
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student`  (
  `StuId` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `StuName` varchar(8) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `StuSex` varchar(2) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Birthday` timestamp(0) NULL DEFAULT NULL,
  `Phone` varchar(12) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Class_id` varchar(4) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `userName` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`StuId`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('000503001', '陈培军', '男', '1983-03-16 00:00:00', '44488225', '广州市工业大道北', '0503', '000503001', '000503001');
INSERT INTO `student` VALUES ('000503002', '艾 添', '女', '1973-04-19 00:00:00', '34470763', '广州市龙口东路', '0503', '000503002', '000503002');
INSERT INTO `student` VALUES ('000503003', '陈四雯', '女', '1979-04-22 00:00:00', '43970360', '广州市华景新城', '0503', '000503003', '000503003');
INSERT INTO `student` VALUES ('000503004', '沈菊菊', '女', '1976-07-24 00:00:00', '37013688', '广州市方村花地大道', '0503', '000503004', '000503004');
INSERT INTO `student` VALUES ('000503005', '佟力何', '女', '1980-01-02 00:00:00', '71001030', '广州市沙园', '0503', '000503005', '000503005');
INSERT INTO `student` VALUES ('000503006', '祁宪戎', '男', '1975-05-19 00:00:00', '41678201', '广州市滨江中路', '0503', '000503006', '000503006');
INSERT INTO `student` VALUES ('000503007', '谈映城', '女', '1978-04-17 00:00:00', '44623771', '广州市沙园', '0503', '000503007', '000503007');
INSERT INTO `student` VALUES ('000503008', '常承朋', '男', '1977-08-22 00:00:00', '48665394', '广州市穗园小区', '0503', '000503008', '000503008');
INSERT INTO `student` VALUES ('980101001', '蒋保佳', '女', '1974-11-02 00:00:00', '48543456', '广州市骏景花园', '0101', '980101001', '980101001');
INSERT INTO `student` VALUES ('980101002', '吴同强', '女', '1982-06-03 00:00:00', '77245032', '广州市二沙岛聚龙明珠花园', '0101', '980101002', '980101002');
INSERT INTO `student` VALUES ('980101003', '涂杰杰', '男', '1972-06-09 00:00:00', '77750891', '广州市珠江新城', '0101', '980101003', '980101003');
INSERT INTO `student` VALUES ('980101004', '毛前琛', '女', '1975-11-02 00:00:00', '74798645', '广州市龙口东路', '0101', '980101004', '980101004');
INSERT INTO `student` VALUES ('980101005', '利旭勉', '女', '1978-08-16 00:00:00', '64193895', '广州市番禺区祈福新村', '0101', '980101005', '980101005');
INSERT INTO `student` VALUES ('980101006', '梅植珠', '女', '1982-03-23 00:00:00', '85126338', '广州市中山七路', '0101', '980101006', '980101006');
INSERT INTO `student` VALUES ('980101007', '谈筱财', '女', '1977-10-01 00:00:00', '72727654', '广州市方村花地大道', '0101', '980101007', '980101007');
INSERT INTO `student` VALUES ('980101010', '伍治苗', '男', '1974-03-12 00:00:00', '34794631', '广州市沙河大街', '0101', '980101010', '980101010');
INSERT INTO `student` VALUES ('980101011', '苏贤兴', '男', '1978-02-07 00:00:00', '71835313', '广州市珠江新城', '0101', '980101011', '980101011');
INSERT INTO `student` VALUES ('980101012', '祝梁骧', '女', '1976-05-16 00:00:00', '43026957', '广州市昌岗中路', '0101', '980101012', '980101012');
INSERT INTO `student` VALUES ('980101013', '孔菁梁', '男', '1977-03-03 00:00:00', '63009683', '广州市东风中路', '0101', '980101013', '980101013');
INSERT INTO `student` VALUES ('980101014', '楼竞悦', '男', '1975-05-06 00:00:00', '65917205', '广州市东风东路', '0101', '980101014', '980101014');
INSERT INTO `student` VALUES ('980101015', '衡妮华', '男', '1970-10-05 00:00:00', '44162007', '广州市穗园小区', '0101', '980101015', '980101015');
INSERT INTO `student` VALUES ('980101016', '白锡赞', '男', '1973-07-20 00:00:00', '46236781', '广州市天河公园', '0101', '980101016', '980101016');
INSERT INTO `student` VALUES ('980101017', '彭灵仪', '男', '1979-11-18 00:00:00', '53158072', '广州市穗园小区', '0101', '980101017', '980101017');
INSERT INTO `student` VALUES ('980101018', '钟晋富', '女', '1976-01-11 00:00:00', '37096125', '广州市广源东碧桂圆', '0101', '980101018', '980101018');
INSERT INTO `student` VALUES ('980101990', 'aab', '男', '1978-03-01 00:00:00', NULL, NULL, '0102', '980101990', '980101990');
INSERT INTO `student` VALUES ('980101991', 'aac', '男', '1978-03-01 00:00:00', NULL, NULL, '0102', '980101991', '980101991');
INSERT INTO `student` VALUES ('980101992', 'aad', '男', '1978-03-01 00:00:00', NULL, NULL, '0102', '980101992', '980101992');
INSERT INTO `student` VALUES ('980104001', '曹夺姬', '男', '1982-04-06 00:00:00', '63708826', '广州市昌岗中路', '0104', '980104001', '980104001');
INSERT INTO `student` VALUES ('980104003', '符梓冬', '女', '1984-04-23 00:00:00', '64329067', '广州市中山大道', '0104', '980104003', '980104003');
INSERT INTO `student` VALUES ('980104004', '艾彤荣', '女', '1972-08-07 00:00:00', '33454974', '广州市穗园小区', '0104', '980104004', '980104004');
INSERT INTO `student` VALUES ('980104005', '袁运旭', '男', '1972-09-04 00:00:00', '78852027', '广州市共和路', '0104', '980104005', '980104005');
INSERT INTO `student` VALUES ('980104006', '佟行婷', '男', '1982-02-06 00:00:00', '63508520', '广州市广源新村', '0104', '980104006', '980104006');
INSERT INTO `student` VALUES ('980104008', '温巧丽', '女', '1973-01-07 00:00:00', '62644333', '广州市解放中路', '0104', '980104008', '980104008');
INSERT INTO `student` VALUES ('980104009', '甄绮忠', '女', '1980-06-16 00:00:00', '85761365', '广州市滨江东路', '0104', '980104009', '980104009');
INSERT INTO `student` VALUES ('980201001', '程武苹', '女', '1971-08-20 00:00:00', '85726513', '广州市体育西路', '0201', '980201001', '980201001');
INSERT INTO `student` VALUES ('980201002', '舒权杏', '男', '1971-08-14 00:00:00', '78340695', '广州市东风中路', '0201', '980201002', '980201002');
INSERT INTO `student` VALUES ('980201004', '植曼曼', '男', '1981-07-20 00:00:00', '61637516', '广州市天河北路', '0201', '980201004', '980201004');
INSERT INTO `student` VALUES ('980201005', '聂多焰', '女', '1984-03-09 00:00:00', '67154589', '广州市仓边路', '0201', '980201005', '980201005');
INSERT INTO `student` VALUES ('980201006', '万韶廉', '男', '1975-03-17 00:00:00', '48509975', '广州市滨江东路', '0201', '980201006', '980201006');
INSERT INTO `student` VALUES ('980201007', '庞菲彰', '女', '1973-01-10 00:00:00', '71970492', '广州市二沙岛聚龙明珠花园', '0201', '980201007', '980201007');
INSERT INTO `student` VALUES ('980201009', '文州鸿', '男', '1984-02-10 00:00:00', '52499271', '广州市中山五路', '0201', '980201009', '980201009');
INSERT INTO `student` VALUES ('980203001', '海浪乐', '男', '1982-02-21 00:00:00', '46788658', '广州市天河北路', '0203', '980203001', '980203001');
INSERT INTO `student` VALUES ('980203002', '甄少彪', '男', '1978-10-20 00:00:00', '82946458', '广州市石牌', '0203', '980203002', '980203002');
INSERT INTO `student` VALUES ('980203003', '贾可琼', '女', '1971-04-22 00:00:00', '45839176', '广州市共和路', '0203', '980203003', '980203003');
INSERT INTO `student` VALUES ('980203004', '连伯吉', '男', '1984-08-17 00:00:00', '75355170', '广州市解放中路', '0203', '980203004', '980203004');
INSERT INTO `student` VALUES ('980203005', '车博勤', '女', '1981-06-13 00:00:00', '49667931', '广州市工业大道北', '0203', '980203005', '980203005');
INSERT INTO `student` VALUES ('980203006', '范已威', '男', '1974-05-25 00:00:00', '83551679', '广州市仓边路', '0203', '980203006', '980203006');
INSERT INTO `student` VALUES ('980203008', '陆蝶*', '女', '1983-11-06 00:00:00', '66900630', '广州市广源新村', '0203', '980203008', '980203008');
INSERT INTO `student` VALUES ('980203009', '毕长蕾', '女', '1970-01-19 00:00:00', '78858968', '广州市方村花地大道', '0203', '980203009', '980203009');
INSERT INTO `student` VALUES ('980203010', '温衍帆', '女', '1978-01-19 00:00:00', '79471942', '广州市沙园', '0203', '980203010', '980203010');
INSERT INTO `student` VALUES ('980203012', '贺翔常', '女', '1982-10-15 00:00:00', '70508223', '广州市同福东路', '0203', '980203012', '980203012');
INSERT INTO `student` VALUES ('980203013', '邝越影', '女', '1982-02-13 00:00:00', '43554201', '广州市宝岗大道', '0203', '980203013', '980203013');
INSERT INTO `student` VALUES ('980203014', '戚徒利', '女', '1974-04-23 00:00:00', '48805968', '广州市体育西路', '0203', '980203014', '980203014');
INSERT INTO `student` VALUES ('980203016', '禹俭韶', '男', '1978-05-23 00:00:00', '58850673', '广州市共和路', '0203', '980203016', '980203016');
INSERT INTO `student` VALUES ('980203017', '柯鹤涛', '女', '1981-03-12 00:00:00', '86926945', '广州市石牌', '0203', '980203017', '980203017');
INSERT INTO `student` VALUES ('980203019', '司竟景', '女', '1973-11-09 00:00:00', '47309695', '广州市中山八路', '0203', '980203019', '980203019');
INSERT INTO `student` VALUES ('980203020', '黎阳韵', '女', '1980-11-23 00:00:00', '84676684', '广州市中山三路', '0203', '980203020', '980203020');
INSERT INTO `student` VALUES ('980203021', '薜咏微', '男', '1982-04-24 00:00:00', '88226745', '广州市人民南路', '0203', '980203021', '980203021');
INSERT INTO `student` VALUES ('980203022', '环茹', '女', '1984-09-13 00:00:00', '78328172', '广州市滨江东路', '0203', '980203022', '980203022');
INSERT INTO `student` VALUES ('980203023', '邓常海', '女', '1975-10-07 00:00:00', '38561933', '广州市解放中路', '0203', '980203023', '980203023');
INSERT INTO `student` VALUES ('980203024', '谢颜尧', '男', '1973-09-24 00:00:00', '61645913', '广州市解放中路', '0203', '980203024', '980203024');
INSERT INTO `student` VALUES ('980203025', '肖震芬', '女', '1983-10-16 00:00:00', '62210028', '广州市骏景花园', '0203', '980203025', '980203025');
INSERT INTO `student` VALUES ('980203026', '房马金', '男', '1972-07-07 00:00:00', '54165208', '广州市珠江新城', '0203', '980203026', '980203026');
INSERT INTO `student` VALUES ('980203027', '鲍焕伦', '男', '1970-10-07 00:00:00', '83191445', '广州市方村花地大道', '0203', '980203027', '980203027');
INSERT INTO `student` VALUES ('980203028', '付娣儿', '女', '1971-11-01 00:00:00', '43820224', '广州市共和路', '0203', '980203028', '980203028');
INSERT INTO `student` VALUES ('980203029', '卫创湖', '女', '1980-09-13 00:00:00', '45776049', '广州市广源东碧桂圆', '0203', '980203029', '980203029');
INSERT INTO `student` VALUES ('980501001', '孔菁梁', '女', '1976-06-12 00:00:00', '42204907', '广州市昌岗中路', '0501', '980501001', '980501001');
INSERT INTO `student` VALUES ('980501002', '李临意', '男', '1977-08-20 00:00:00', '42451973', '广州市骏景花园', '0501', '980501002', '980501002');
INSERT INTO `student` VALUES ('980501003', '曹倩洪', '男', '1971-01-20 00:00:00', '44389700', '广州市体育西路', '0501', '980501003', '980501003');
INSERT INTO `student` VALUES ('980501004', '南泽均', '男', '1981-10-11 00:00:00', '39210576', '广州市龙口东路', '0501', '980501004', '980501004');
INSERT INTO `student` VALUES ('980501005', '施士盛', '男', '1973-06-14 00:00:00', '56699160', '广州市中山七路', '0501', '980501005', '980501005');
INSERT INTO `student` VALUES ('980501006', '卢洁炎', '女', '1984-08-09 00:00:00', '50659332', '广州市教育路', '0501', '980501006', '980501006');
INSERT INTO `student` VALUES ('980501007', '阳荔藩', '女', '1983-07-02 00:00:00', '35225007', '广州市中山大道', '0501', '980501007', '980501007');
INSERT INTO `student` VALUES ('980501008', '胡舒', '男', '1977-07-08 00:00:00', '58305454', '广州市滨江中路', '0501', '980501008', '980501008');
INSERT INTO `student` VALUES ('980501009', '袁嵩娥', '男', '1976-04-02 00:00:00', '69711319', '广州市中山七路', '0501', '980501009', '980501009');
INSERT INTO `student` VALUES ('980501010', '贺汝港', '男', '1984-05-26 00:00:00', '39817550', '广州市前进路', '0501', '980501010', '980501010');
INSERT INTO `student` VALUES ('980501013', '莫媛稷', '男', '1977-08-05 00:00:00', '55200405', '广州市康乐村', '0501', '980501013', '980501013');
INSERT INTO `student` VALUES ('980501015', '向玲雷', '男', '1974-04-27 00:00:00', '38384912', '广州市方村花地大道', '0501', '980501015', '980501015');
INSERT INTO `student` VALUES ('990102001', '盘赐楷', '男', '1971-11-11 00:00:00', '84843152', '广州市同福东路', '0102', '990102001', '990102001');
INSERT INTO `student` VALUES ('990102002', '汉逊欣', '男', '1972-11-10 00:00:00', '36926929', '广州市五山', '0102', '990102002', '990102002');
INSERT INTO `student` VALUES ('990102003', '南泽均', '男', '1982-04-11 00:00:00', '70609569', '广州市共和路', '0102', '990102003', '990102003');
INSERT INTO `student` VALUES ('990102004', '孔艾森', '男', '1980-11-10 00:00:00', '48203726', '广州市骏景花园', '0102', '990102004', '990102004');
INSERT INTO `student` VALUES ('990102005', '王媚甜', '女', '1975-04-26 00:00:00', '53556900', '广州市同德围', '0102', '990102005', '990102005');
INSERT INTO `student` VALUES ('990102006', '麦跃禧', '男', '1983-09-12 00:00:00', '84040901', '广州市前进路', '0102', '990102006', '990102006');
INSERT INTO `student` VALUES ('990102007', '陶肄略', '女', '1974-10-07 00:00:00', '78288538', '广州市中山大道', '0102', '990102007', '990102007');
INSERT INTO `student` VALUES ('990102008', '龚焯翔', '女', '1983-09-10 00:00:00', '70911509', '广州市解放中路', '0102', '990102008', '990102008');
INSERT INTO `student` VALUES ('990102012', '蚁贺薇', '女', '1975-05-09 00:00:00', '80045686', '广州市昌岗中路', '0102', '990102012', '990102012');
INSERT INTO `student` VALUES ('990102013', '梅英寰', '男', '1976-08-18 00:00:00', '61495020', '广州市五山', '0102', '990102013', '990102013');
INSERT INTO `student` VALUES ('990102014', '喻焰梨', '女', '1973-04-13 00:00:00', '50493909', '广州市广源新村', '0102', '990102014', '990102014');
INSERT INTO `student` VALUES ('990102015', '左永毅', '男', '1979-06-18 00:00:00', '72268585', '广州市滨江东路', '0102', '990102015', '990102015');
INSERT INTO `student` VALUES ('990102016', '吕金鹏', '男', '1975-05-20 00:00:00', '39669065', '广州市广源新村', '0102', '990102016', '990102016');
INSERT INTO `student` VALUES ('990102017', '招茂晟', '女', '1976-02-21 00:00:00', '88590529', '广州市方村花地大道', '0102', '990102017', '990102017');
INSERT INTO `student` VALUES ('990102018', '史捷沪', '女', '1981-09-17 00:00:00', '50148895', '广州市田心花园', '0102', '990102018', '990102018');
INSERT INTO `student` VALUES ('990102019', '招恩焕', '女', '1979-07-23 00:00:00', '70408411', '广州市骏景花园', '0102', '990102019', '990102019');
INSERT INTO `student` VALUES ('990102020', '程鸿池', '女', '1975-10-19 00:00:00', '81692049', '广州市沙太路', '0102', '990102020', '990102020');
INSERT INTO `student` VALUES ('990102021', '袁运旭', '男', '1970-10-09 00:00:00', '75541579', '广州市中山八路', '0102', '990102021', '990102021');
INSERT INTO `student` VALUES ('990102990', 'abe', '男', '1978-03-01 00:00:00', NULL, NULL, '0102', '990102990', '990102990');
INSERT INTO `student` VALUES ('990105001', '茹幸横', '男', '1982-10-24 00:00:00', '42111716', '广州市番禺区祈福新村', '0105', '990105001', '990105001');
INSERT INTO `student` VALUES ('990105002', '洪本羡', '女', '1970-03-19 00:00:00', '75443687', '广州市番禺区祈福新村', '0105', '990105002', '990105002');
INSERT INTO `student` VALUES ('990105003', '熊卓芝', '女', '1982-05-10 00:00:00', '66276095', '广州市天河北路', '0105', '990105003', '990105003');
INSERT INTO `student` VALUES ('990105004', '利蕤琨', '女', '1979-09-11 00:00:00', '84639377', '广州市中山三路', '0105', '990105004', '990105004');
INSERT INTO `student` VALUES ('990105005', '沈柏培', '男', '1974-04-01 00:00:00', '67480931', '广州市沙园', '0105', '990105005', '990105005');
INSERT INTO `student` VALUES ('990105006', '邹利铎', '男', '1971-01-13 00:00:00', '51454243', '广州市中山七路', '0105', '990105006', '990105006');
INSERT INTO `student` VALUES ('990105010', '邝从显', '女', '1982-05-19 00:00:00', '84256061', '广州市田心花园', '0105', '990105010', '990105010');
INSERT INTO `student` VALUES ('990105011', '庞渭男', '女', '1977-06-27 00:00:00', '68780341', '广州市珠江新城', '0105', '990105011', '990105011');
INSERT INTO `student` VALUES ('990105013', '布经蓉', '男', '1970-03-08 00:00:00', '79369611', '广州市昌岗中路', '0105', '990105013', '990105013');
INSERT INTO `student` VALUES ('990105014', '宗琼耀', '男', '1980-10-01 00:00:00', '42579615', '广州市方村花地大道', '0105', '990105014', '990105014');
INSERT INTO `student` VALUES ('990105015', '傅贵成', '男', '1977-10-04 00:00:00', '80650671', '广州市人民南路', '0105', '990105015', '990105015');
INSERT INTO `student` VALUES ('990105018', '李省幸', '男', '1975-03-17 00:00:00', '40060665', '广州市石牌', '0105', '990105018', '990105018');
INSERT INTO `student` VALUES ('990502001', '颜琳捷', '男', '1972-05-09 00:00:00', '88111389', '广州市同福东路', '0502', '990502001', '990502001');
INSERT INTO `student` VALUES ('990502002', '汪就岸', '女', '1979-10-12 00:00:00', '54525294', '广州市昌岗中路', '0502', '990502002', '990502002');
INSERT INTO `student` VALUES ('990502004', '黎苏绍', '女', '1976-09-04 00:00:00', '78563991', '广州市共和大街', '0502', '990502004', '990502004');
INSERT INTO `student` VALUES ('990502006', '邱全全', '男', '1984-09-05 00:00:00', '74487139', '广州市滨江中路', '0502', '990502006', '990502006');
INSERT INTO `student` VALUES ('990502007', '涂杰杰', '男', '1973-09-01 00:00:00', '48321463', '广州市广源东碧桂圆', '0502', '990502007', '990502007');
INSERT INTO `student` VALUES ('990502008', '贺翔常', '男', '1984-06-16 00:00:00', '73238632', '广州市康乐村', '0502', '990502008', '990502008');
INSERT INTO `student` VALUES ('990502009', '易静昶', '男', '1984-11-01 00:00:00', '79285833', '广州市仓边路', '0502', '990502009', '990502009');
INSERT INTO `student` VALUES ('s25328', '武松', '女', '1990-02-21 00:00:00', NULL, NULL, '01', 's25328', 's25328');

SET FOREIGN_KEY_CHECKS = 1;
